DataFrame

In [1]:
import pandas as pd
s=['a','b','c','d']
sdf=pd.DataFrame(s)
print(sdf)
sdf# Display a DF without usign print()

   0
0  a
1  b
2  c
3  d

   0
0  a
1  b
2  c
3  d

In [2]:
dic={'Name':["Karan","Arjun"],'Team':["KKR","SRH"]}
df=pd.DataFrame(dic)
df

    Name Team
0  Karan  KKR
1  Arjun  SRH

In [3]:
name=pd.Series(["Karan","Arjun"])
team=pd.Series(["KKR","SRH"])
dic1={"Name":name,"Team":team}
dic2=pd.DataFrame(dic1)
print(dic2)

    Name Team
0  Karan  KKR
1  Arjun  SRH

In [6]:
dic3=[
    {'FirstName':'Satwik','LastName':'Mishra'},
     {'FirstName':'Swayam','LastName':'Jethy'},
     {'FirstName':'Sanket','LastName':'Bharadwaj'}]
df1=pd.DataFrame(dic3)
df1

  FirstName   LastName
0    Satwik     Mishra
1    Swayam      Jethy
2    Sanket  Bharadwaj

In [11]:
#Row and Column Iteration
for (row_index, row_value) in df1.iterrows():
    print("Row Index is ::",row_index )
    print("Row Value is :: ",row_value)

Row Index is :: 0
Row Value is ::  FirstName    Satwik
LastName     Mishra
Name: 0, dtype: object
Row Index is :: 1
Row Value is ::  FirstName    Swayam
LastName      Jethy
Name: 1, dtype: object
Row Index is :: 2
Row Value is ::  FirstName       Sanket
LastName     Bharadwaj
Name: 2, dtype: object

In [12]:
for (coulumn_name, coulumn_value) in df1.items():
    print("Column Name is ::",coulumn_name )
    print("Column Value is :: ",coulumn_value)

Column Name is :: FirstName
Column Value is ::  0    Satwik
1    Swayam
2    Sanket
Name: FirstName, dtype: object
Column Name is :: LastName
Column Value is ::  0       Mishra
1        Jethy
2    Bharadwaj
Name: LastName, dtype: object

In [9]:
empdata = {
    'emp_id': [101, 102, 103, 104, 105, 106],
    'e_name': ['Sachin', 'Vinod', 'Lakhbir', 'Anil', 'Devinder', 'UmaSelvi'],
    'Doj': ['12-01-2012', '15-01-2012', '05-09-2007', '17-01-2012', '05-09-2007', '16-01-2012']
}
df2=pd.DataFrame(empdata)
df2

   emp_id    e_name         Doj
0     101    Sachin  12-01-2012
1     102     Vinod  15-01-2012
2     103   Lakhbir  05-09-2007
3     104      Anil  17-01-2012
4     105  Devinder  05-09-2007
5     106  UmaSelvi  16-01-2012

In [14]:
df2.emp_id

0    101
1    102
2    103
3    104
4    105
5    106
Name: emp_id, dtype: int64

In [18]:
df2[['emp_id','e_name']]

   emp_id    e_name
0     101    Sachin
1     102     Vinod
2     103   Lakhbir
3     104      Anil
4     105  Devinder
5     106  UmaSelvi

In [17]:
df2.emp_id[3]

104

In [15]:
s = pd.Series([10,15,18,22]) 
df=pd.DataFrame(s) 
df

    0
0  10
1  15
2  18
3  22

In [16]:
df.columns=['Lt1']
df

   Lt1
0   10
1   15
2   18
3   22

In [19]:
df['Lt2']=[30,40,50,60]
df

   Lt1  Lt2
0   10   30
1   15   40
2   18   50
3   22   60

In [20]:
df['Lt3']=df['Lt1']+df['Lt2']
df

   Lt1  Lt2  Lt3
0   10   30   40
1   15   40   55
2   18   50   68
3   22   60   82

In [24]:
df['Lt1']=[10,15,18,22]
df['Lt3']=df['Lt1']+df['Lt2']
df

   Lt2  Lt1  Lt3
0   30   10   40
1   40   15   55
2   50   18   68
3   60   22   82

In [25]:
del df['Lt3']
df

   Lt2  Lt1
0   30   10
1   40   15
2   50   18
3   60   22

In [27]:
df.pop('Lt2')

0    30
1    40
2    50
3    60
Name: Lt2, dtype: int64

In [28]:
df['Lt2']=[30,40,50,60]
df['Lt3']=df['Lt1']+df['Lt2']

In [33]:
df1=df.drop(index=[2,3],axis=1)
df1

   Lt1  Lt2
0   10   30
1   15   40

In [34]:
Runs = {
    'TCS': {'Qtr1': 2500, 'Qtr2': 2000, 'Qtr3': 3000, 'Qtr4': 2000},
    'WIPRO': {'Qtr1': 2800, 'Qtr2': 2400, 'Qtr3': 3600, 'Qtr4': 2400},
    'L&T': {'Qtr1': 2100, 'Qtr2': 5700, 'Qtr3': 35000, 'Qtr4': 2100}
}
#print(type(Runs))
df = pd.DataFrame(Runs)
df

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000
Qtr4  2000   2400   2100

In [35]:
df2=df.loc['Qtr3',:]
df2

TCS       3000
WIPRO     3600
L&T      35000
Name: Qtr3, dtype: int64

In [37]:
df2=df.loc['Qtr1':'Qtr3',:]
df2

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000

In [38]:
print(df.loc[:,'TCS'])

Qtr1    2500
Qtr2    2000
Qtr3    3000
Qtr4    2000
Name: TCS, dtype: int64

In [39]:
empdata = {
    'empid': [101, 102, 103, 104, 105, 106],
    'ename': ['Sachin', 'Vinod', 'Lakhbir', 'Anil', 'Devinder', 'UmaSelvi'],
    'Doj': ['12-01-2012', '15-01-2012', '05-09-2007', '17-01-2012', '05-09-2007', '16-01-2012']
}
#print(type(empdata))
df = pd.DataFrame(empdata)
df

   empid     ename         Doj
0    101    Sachin  12-01-2012
1    102     Vinod  15-01-2012
2    103   Lakhbir  05-09-2007
3    104      Anil  17-01-2012
4    105  Devinder  05-09-2007
5    106  UmaSelvi  16-01-2012

In [40]:
# Data dictionary for company earnings
Runs = {
    'TCS': {'Qtr1': '2500', 'Qtr2': '2000', 'Qtr3': '3000', 'Qtr4': '2000'},
    'WIPRO': {'Qtr1': '2800', 'Qtr2': '2400', 'Qtr3': '3600', 'Qtr4': '2400'},
    'L&T': {'Qtr1': '2100', 'Qtr2': '5700', 'Qtr3': '35000', 'Qtr4': '2100'}
}
df = pd.DataFrame(Runs)
print(df)
# Accessing specific rows and columns using iloc
print(df.iloc[0:2, 1:2])  # First 2 rows, second column
print(df.iloc[:, 0:2])    # All rows, first 2 columns

       TCS WIPRO    L&T
Qtr1  2500  2800   2100
Qtr2  2000  2400   5700
Qtr3  3000  3600  35000
Qtr4  2000  2400   2100
     WIPRO
Qtr1  2800
Qtr2  2400
       TCS WIPRO
Qtr1  2500  2800
Qtr2  2000  2400
Qtr3  3000  3600
Qtr4  2000  2400

In [41]:
# Data for students' marks in different tests
marks = pd.DataFrame({
    'Wally' : [87, 89, 93, 87, 92],
    'Eva' : [95, 99, 87, 88, 84],
    'Sam' : [88, 94, 85, 89, 95],
    'Katie' : [87, 92, 95, 84, 85],
    'Bob' : [83, 93, 86, 83, 87]
}, index = ['Test01', 'Test02', 'Test03', 'Test04', 'Test05'])
marks

        Wally  Eva  Sam  Katie  Bob
Test01     87   95   88     87   83
Test02     89   99   94     92   93
Test03     93   87   85     95   86
Test04     87   88   89     84   83
Test05     92   84   95     85   87

In [42]:
print(marks['Eva']['Test01'])

95

In [ ]:
print(marks['Test01']['Eva'])#galat

In [44]:
print(marks.Eva.Test01)

95

In [45]:
print(marks.at['Test01','Sam'])

88

In [46]:
print(marks.iat[0,1])

95

In [50]:
marks[marks>=90]

        Wally   Eva   Sam  Katie   Bob
Test01    NaN  95.0   NaN    NaN   NaN
Test02    NaN  99.0  94.0   92.0  93.0
Test03   93.0   NaN   NaN   95.0   NaN
Test04    NaN   NaN   NaN    NaN   NaN
Test05   92.0   NaN  95.0    NaN   NaN

In [49]:
marks[marks>=[90,91,92,93,94]]

        Wally   Eva   Sam  Katie  Bob
Test01    NaN  95.0   NaN    NaN  NaN
Test02    NaN  99.0  94.0    NaN  NaN
Test03   93.0   NaN   NaN   95.0  NaN
Test04    NaN   NaN   NaN    NaN  NaN
Test05   92.0   NaN  95.0    NaN  NaN

In [53]:
marks[(marks>90) & (marks<93)]

        Wally  Eva  Sam  Katie  Bob
Test01    NaN  NaN  NaN    NaN  NaN
Test02    NaN  NaN  NaN   92.0  NaN
Test03    NaN  NaN  NaN    NaN  NaN
Test04    NaN  NaN  NaN    NaN  NaN
Test05   92.0  NaN  NaN    NaN  NaN